{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<h1>Traveling Salesman Problem</h1>\n<p>The traveling salesman problem (TSP) asks the question, \"Given a list of cities and the distances between each pair of cities, what is the shortest possible route that visits each city and returns to the origin city?\".</p>\n<p>It has been studied extensively in computer science and plenty of algorithms have been devised, generally classified as exhaustive or heuristic.</p>\n<h4>Exhaustive</h4>\n<p>Exhaustive algorithms will always find the best possible solution by evaluating every possible path. These algorithms are typically significantly more expensive then the heuristic algorithms discussed next. The exhaustive algorithms implemented so far include:</p>\n<ul>\n<li>Random Paths</li>\n<li>Depth First Search (Brute Force)</li>\n<li>Branch and Bound (Cost)</li>\n</ul>\n<h4>Heuristic</h4>\n<p>Heuristic algorithms attempt to find a good approximation of the optimal path within a more <i>reasonable</i> amount of time. The heuristic algorithms implemented so far include:</p>\n<ul>\n<li>Shortest Path</li>\n<li>2-Opt Substitution</li>\n</ul>\n<h3>This site</h3>\n<p>Some of the main things to keep in mind when using this site:</p>\n<ul>\n<li>As you apply different algorithms, the current best path is saved and used as input to whatever you run next. (e.g. shortest path first -> branch and bound)</li>\n<li>These are not intended to be ultra-effecient - although these algorithms visualize and demonstrate how to solve the traveling salesman problem, much more effecient means are available outside of the browser.</li>\n</ul>\n<h2>FAQ</h2>\n<p><strong>Javascript is slow, use a manly language like C (better yet, rust)</strong></p>\n<p>The point of this is not to be an efficient means to solve real-world traveling salesman problems, but to be an interactive learning experience for those looking to familiarize themselves with common algorithms.</p>\n<p><strong>You're implementation is ineffecient</strong></p>\n<p>I'm open to pull requests that improve the efficiency of the algorithms demonstrated, or suggestions on how to make them better.</p>\n<p><strong>I heard about, or have an idea for, an algorithm that I want simulated</strong></p>\n<p>Finally, a question! I'm open to pull-requests. If javascript isn't your thing, reach out to me on <a href=\"https://github.com/jhackshaw/tspvis\">github</a> and I will help you introduce it to the site.</p>\n<p><strong>I'm still not getting it</strong></p>\n<p>There are lots of resources out there - this is an extensivly studied problem. Open an issue on github <a href=\"https://github.com/jhackshaw/tspvis/issues\">here</a> and I promise I will respond with resources for further study.</p>\n<p><strong>How does it work</strong></p>\n<p>These are the main tools used to build this site:</p>\n<ul>\n<li><a href=\"https://www.gatsbyjs.org\">gatsbyjs</a></li>\n<li><a href=\"https://reactjs.org\">reactjs</a></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API\">web workers</a></li>\n<li><a href=\"https://material-ui.com/\">material-ui</a></li>\n<li><a href=\"https://deck.gl/#/\">deck.gl</a></li>\n<li><a href=\"https://www.mapbox.com/\">mapbox</a></li>\n</ul>\n<p>The source code is <a href=\"https://github.com/jhackshaw/tspvis\">here</a></p>"}}]}}}